package com.wzh.mqtt.result;


/**
 * 在ResultCode.properties里定义，使用ErrorCodeEnumGenerate生成
 *
 * @author wangzouhuax
 */
public enum ErrorCodeEnum {
	L103002("L-103002", "文件名错误，{0}"),
	L103003("L-103003", "文件过大，{0}mb"),
	L103004("L-103004", "文件{0}导入失败"),
	L103005("L-103005", "文件导入行数{0}过多，应小于等于{1}"),
	L103006("L-103006", "卡密更新失败"),
	L103007("L-103007", "卡密的生效时间和失效时间有误,时间:{0},{1}"),
	L103008("L-103008", "{0}保存失败"),
	L103009("L-103009", "券码只能绑定到一个存在的产品"),
	N000000("N-000000", "操作成功"),
	N000001("N-000001", "操作失败"),
	N000002("N-000002", "此功能您没有权限访问，请联系管理员"),
	N000003("N-000003", "参数不正确"),
	N000004("N-000004", "重复提交"),
	N000005("N-000005", "操作频繁，请稍后重试！"),
	N000006("N-000006", "输入内容包含非法字符"),
	N000008("N-000008", "操作失败，{0}"),
	Y000000("Y-000000", "占位");

    public  final String code;
    public  final String msg;
    ErrorCodeEnum(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }
}
